tutorials/incompressibleFluid/drivaerFastback/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// adjustTimeStep  yes;

// maxCo           1;

#includeFunc forceCoeffsIncompressible

#includeFunc time

#includeFunc streamlinesSphere
(
    name=streamlines,
    centre=(4 0 0.7),
    radius=1,
    nPoints=30,
    fields=(U)
)

#includeFunc cutPlaneSurface
(
    name=xNormal,
    point=(4 0 1),
    normal=(1 0 0),
    fields=(p U)
)

#includeFunc cutPlaneSurface
(
    name=yNormal,
    point=(-5 0.02 1),
    normal=(0 1 0),
    fields=(p U)
)

#includeFunc patchSurface(name=car, patch=".*(body|Wheels)", p)

// ************************************************************************* //
